In [1]:
!pip install psycopg2-binary
!pip install pymysql

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.11/site-packages (2.9.10)
Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.11/site-packages (1.1.1)

In [2]:
import psycopg2
print("psycopg2 installed successfully!")
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
from dbeaver_connect import create_df_pymysql

psycopg2 installed successfully!

In [3]:
import pymysql
import pandas as pd

def fetch_data():
    """ Connects to MySQL, fetches data, and returns a Pandas DataFrame. """
    try:
        conn = pymysql.connect(
            host='eufmd-database-1.cqodkl4vazie.eu-north-1.rds.amazonaws.com',
            user='root',
            password='YOUR_PASSWORD',
            database='db_training',
            port=3306,
            cursorclass=pymysql.cursors.DictCursor
        )
        print("✅ Connected to database successfully!")

        # Execute query
        with conn.cursor() as cursor:
            query = "SELECT * FROM moodle_enrols;"
            cursor.execute(query)
            columns = [desc[0] for desc in cursor.description]  # Get column names
            rows = cursor.fetchall()  # Fetch all rows

        # Convert to DataFrame
        df = pd.DataFrame(rows, columns=columns)
        return df

    except pymysql.Error as e:
        print(f"❌ Error: {e}")
        return None

    finally:
        if conn:
            conn.close()
            print("✅ Database connection closed.")

# Run the script
if __name__ == "__main__":
    df = fetch_data()
    if df is not None:
        print(df.head())  # Print first 5 rows

✅ Connected to database successfully!
✅ Database connection closed.
   id  user_id  course_id  enrol_date completion_date  progress status
0   1       19         14  2013-08-12            None        50   open
1   2      155         14  2013-10-18            None        50   open
2   3       56         14  2013-08-12            None        50   open
3   4      156          3  2013-10-18            None        50   open
4   5       35         14  2013-08-12            None        50   open

In [4]:
df

,id,user_id,course_id,enrol_date,completion_date,progress,status
0,1,19,14,2013-08-12,None,50,open
1,2,155,14,2013-10-18,None,50,open
2,3,56,14,2013-08-12,None,50,open
3,4,156,3,2013-10-18,None,50,open
4,5,35,14,2013-08-12,None,50,open
...,...,...,...,...,...,...,...
128128,141132,5099,466,2025-01-30,0000-00-00,50,open
128129,141133,12197,466,2025-01-30,0000-00-00,50,open
128130,141135,4599,466,2025-01-30,0000-00-00,50,open
128131,141137,11020,466,2025-01-30,0000-00-00,50,open
128132,141138,21266,466,2025-01-30,0000-00-00,50,open

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128133 entries, 0 to 128132
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   id               128133 non-null  int64
 1   user_id          128133 non-null  int64
 2   course_id        128133 non-null  int64
 3   enrol_date       128133 non-null  object
 4   completion_date  34651 non-null   object
 5   progress         128133 non-null  int64
 6   status           128133 non-null  object
dtypes: int64(4), object(3)
memory usage: 6.8+ MB
None

In [6]:
print(f"duplicates:{df.duplicated().sum()}")

duplicates:0

In [7]:
print(df["course_id"].unique()[:10])

[14  3 20 21  4  2 28 12 13 16]

In [8]:
print(df.describe())

                  id        user_id      course_id       progress
count  128133.000000  128133.000000  128133.000000  128133.000000
mean    65936.148572   17440.345118     194.122607      60.712697
std     39771.725504   18222.115558     172.025990      20.515269
min         1.000000       2.000000       2.000000      50.000000
25%     32035.000000    4241.000000      14.000000      50.000000
50%     64068.000000   10750.000000     164.000000      50.000000
75%     96101.000000   22434.000000     379.000000      50.000000
max    141138.000000   67680.000000     466.000000     100.000000

In [9]:
print(df["progress"].value_counts())

progress
50     100680
100     27453
Name: count, dtype: int64

In [10]:
print(df["completion_date"].value_counts())

completion_date
0000-00-00    7198
2024-07-31     607
2024-10-11     479
2024-12-20     398
2024-11-07     388
              ...
2019-08-04       1
2019-07-17       1
2019-07-03       1
2022-11-26       1
2022-01-26       1
Name: count, Length: 2315, dtype: int64

## Data Preprocessing

In [11]:
print(df.isnull().sum())  # Count missing values in each column

id                     0
user_id                0
course_id              0
enrol_date             0
completion_date    93482
progress               0
status                 0
dtype: int64

In [12]:
# Fill in missing values with "missing completion date"
df["completion_date"].fillna("unknown completion date", inplace=True)

In [13]:
print(df["completion_date"].value_counts())

completion_date
unknown completion date    93482
0000-00-00                  7198
2024-07-31                   607
2024-10-11                   479
2024-12-20                   398
                           ...
2022-11-25                     1
2018-09-28                     1
2018-09-13                     1
2019-06-03                     1
2022-01-26                     1
Name: count, Length: 2316, dtype: int64

In [14]:
print(df.isnull().sum())

id                 0
user_id            0
course_id          0
enrol_date         0
completion_date    0
progress           0
status             0
dtype: int64

In [15]:
df.head(10)  # Displays the first matching row

,id,user_id,course_id,enrol_date,completion_date,progress,status
0,1,19,14,2013-08-12,unknown completion date,50,open
1,2,155,14,2013-10-18,unknown completion date,50,open
2,3,56,14,2013-08-12,unknown completion date,50,open
3,4,156,3,2013-10-18,unknown completion date,50,open
4,5,35,14,2013-08-12,unknown completion date,50,open
5,6,156,14,2013-10-18,unknown completion date,50,open
6,7,22,14,2013-08-12,unknown completion date,50,open
7,8,156,20,2013-10-18,unknown completion date,50,open
8,9,46,14,2013-08-12,unknown completion date,50,open
9,10,156,21,2013-10-18,unknown completion date,50,open

In [16]:
df.sample(10)

,id,user_id,course_id,enrol_date,completion_date,progress,status
118867,130831,61226,433,2024-10-07,2024-11-04,100,completed
79271,79273,19854,365,2022-05-30,unknown completion date,50,open
101955,104290,49726,437,2024-06-13,unknown completion date,50,open
38598,38600,6704,3,2018-06-06,unknown completion date,50,open
77352,77354,20763,356,2022-03-15,unknown completion date,50,open
74232,74234,19810,230,2021-12-13,unknown completion date,50,open
71054,71056,18913,3,2021-08-22,unknown completion date,50,open
47646,47648,9607,199,2019-03-20,unknown completion date,50,open
34610,34612,6280,3,2018-03-28,unknown completion date,50,open
88950,88952,30360,3,2023-04-03,unknown completion date,50,open

In [17]:
import numpy as np

df["completion_date"] = df["completion_date"].replace(["unknown completion date", "0000-00-00"], np.nan)

In [18]:
df

,id,user_id,course_id,enrol_date,completion_date,progress,status
0,1,19,14,2013-08-12,NaN,50,open
1,2,155,14,2013-10-18,NaN,50,open
2,3,56,14,2013-08-12,NaN,50,open
3,4,156,3,2013-10-18,NaN,50,open
4,5,35,14,2013-08-12,NaN,50,open
...,...,...,...,...,...,...,...
128128,141132,5099,466,2025-01-30,NaN,50,open
128129,141133,12197,466,2025-01-30,NaN,50,open
128130,141135,4599,466,2025-01-30,NaN,50,open
128131,141137,11020,466,2025-01-30,NaN,50,open
128132,141138,21266,466,2025-01-30,NaN,50,open

In [19]:
df.head(50)

    id  user_id  course_id  enrol_date completion_date  progress     status
0    1       19         14  2013-08-12             NaN        50       open
1    2      155         14  2013-10-18             NaN        50       open
2    3       56         14  2013-08-12             NaN        50       open
3    4      156          3  2013-10-18             NaN        50       open
4    5       35         14  2013-08-12             NaN        50       open
5    6      156         14  2013-10-18             NaN        50       open
6    7       22         14  2013-08-12             NaN        50       open
7    8      156         20  2013-10-18             NaN        50       open
8    9       46         14  2013-08-12             NaN        50       open
9   10      156         21  2013-10-18             NaN        50       open
10  11       15         14  2013-08-12             NaN        50       open
11  12      157          3  2013-10-18             NaN        50       open
12  13       14         14  2013-08-12             NaN        50       open
13  14      157         20  2013-10-18             NaN        50       open
14  15       48         14  2013-08-12             NaN        50       open
15  16      157         14  2013-10-18             NaN        50       open
16  17      158          3  2013-10-18             NaN        50       open
17  18      158         20  2013-10-18             NaN        50       open
18  19      158         14  2013-10-18             NaN        50       open
19  20       40          4  2013-10-23             NaN        50       open
20  21      159          3  2013-10-23             NaN        50       open
21  22      159         21  2013-10-23      2013-11-19       100  completed
22  23      159         14  2013-10-23             NaN        50       open
23  24        6          2  2013-05-17             NaN        50       open
24  25        6          3  2013-05-17             NaN        50       open
25  26        6          4  2013-05-18             NaN        50       open
26  27        2          4  2013-05-18             NaN        50       open
27  28       10          2  2013-05-20             NaN        50       open
28  29        9          2  2013-05-20             NaN        50       open
29  30       13          2  2013-05-20             NaN        50       open
30  31       11          2  2013-05-20             NaN        50       open
31  32       12          2  2013-05-20             NaN        50       open
32  33        8          2  2013-05-20             NaN        50       open
33  34       10          3  2013-05-20             NaN        50       open
34  35        9          3  2013-05-20             NaN        50       open
35  36       13          3  2013-05-20             NaN        50       open
36  37       11          3  2013-05-20             NaN        50       open
37  38       12          3  2013-05-20             NaN        50       open
38  39      231         28  2014-02-06      2014-02-19       100  completed
39  40      232         14  2014-02-06             NaN        50       open
40  41      232          3  2014-02-06             NaN        50       open
41  42      232         28  2014-02-06      2014-04-11       100  completed
42  43      233         14  2014-02-06             NaN        50       open
43  44      233          3  2014-02-06             NaN        50       open
44  45      233         28  2014-02-06             NaN        50       open
45  46      234         14  2014-02-06             NaN        50       open
46  47      234          3  2014-02-06             NaN        50       open
47  48      234         28  2014-02-06             NaN        50       open
48  49      235         14  2014-02-06             NaN        50       open
49  50      235          3  2014-02-06             NaN        50       open

In [20]:
df.reset_index(drop=True, inplace=True)

In [21]:
df.drop(columns=["id"], inplace=True)

In [22]:
df

        user_id  course_id  enrol_date completion_date  progress status
0            19         14  2013-08-12             NaN        50   open
1           155         14  2013-10-18             NaN        50   open
2            56         14  2013-08-12             NaN        50   open
3           156          3  2013-10-18             NaN        50   open
4            35         14  2013-08-12             NaN        50   open
...         ...        ...         ...             ...       ...    ...
128128     5099        466  2025-01-30             NaN        50   open
128129    12197        466  2025-01-30             NaN        50   open
128130     4599        466  2025-01-30             NaN        50   open
128131    11020        466  2025-01-30             NaN        50   open
128132    21266        466  2025-01-30             NaN        50   open

[128133 rows x 6 columns]

In [23]:
df.head(50)

    user_id  course_id  enrol_date completion_date  progress     status
0        19         14  2013-08-12             NaN        50       open
1       155         14  2013-10-18             NaN        50       open
2        56         14  2013-08-12             NaN        50       open
3       156          3  2013-10-18             NaN        50       open
4        35         14  2013-08-12             NaN        50       open
5       156         14  2013-10-18             NaN        50       open
6        22         14  2013-08-12             NaN        50       open
7       156         20  2013-10-18             NaN        50       open
8        46         14  2013-08-12             NaN        50       open
9       156         21  2013-10-18             NaN        50       open
10       15         14  2013-08-12             NaN        50       open
11      157          3  2013-10-18             NaN        50       open
12       14         14  2013-08-12             NaN        50       open
13      157         20  2013-10-18             NaN        50       open
14       48         14  2013-08-12             NaN        50       open
15      157         14  2013-10-18             NaN        50       open
16      158          3  2013-10-18             NaN        50       open
17      158         20  2013-10-18             NaN        50       open
18      158         14  2013-10-18             NaN        50       open
19       40          4  2013-10-23             NaN        50       open
20      159          3  2013-10-23             NaN        50       open
21      159         21  2013-10-23      2013-11-19       100  completed
22      159         14  2013-10-23             NaN        50       open
23        6          2  2013-05-17             NaN        50       open
24        6          3  2013-05-17             NaN        50       open
25        6          4  2013-05-18             NaN        50       open
26        2          4  2013-05-18             NaN        50       open
27       10          2  2013-05-20             NaN        50       open
28        9          2  2013-05-20             NaN        50       open
29       13          2  2013-05-20             NaN        50       open
30       11          2  2013-05-20             NaN        50       open
31       12          2  2013-05-20             NaN        50       open
32        8          2  2013-05-20             NaN        50       open
33       10          3  2013-05-20             NaN        50       open
34        9          3  2013-05-20             NaN        50       open
35       13          3  2013-05-20             NaN        50       open
36       11          3  2013-05-20             NaN        50       open
37       12          3  2013-05-20             NaN        50       open
38      231         28  2014-02-06      2014-02-19       100  completed
39      232         14  2014-02-06             NaN        50       open
40      232          3  2014-02-06             NaN        50       open
41      232         28  2014-02-06      2014-04-11       100  completed
42      233         14  2014-02-06             NaN        50       open
43      233          3  2014-02-06             NaN        50       open
44      233         28  2014-02-06             NaN        50       open
45      234         14  2014-02-06             NaN        50       open
46      234          3  2014-02-06             NaN        50       open
47      234         28  2014-02-06             NaN        50       open
48      235         14  2014-02-06             NaN        50       open
49      235          3  2014-02-06             NaN        50       open

## How can one tell which student enrolled into which course and if the course was completed or not?
## Assume moodle enrollements are stored in moodle_enrols with a 'user_id' and non_moodle_enrols without a 'user_id'
both will have a 'course _id' and a 'progress'

In [25]:
df_sorted = df.sort_values(by=['user_id', 'course_id'])
print("\nAll Enrollments:")
print(df_sorted)

All Enrollments:
        user_id  course_id  enrol_date completion_date  progress status
3439          2          3  2013-08-10             NaN        50   open
21043         2          3  2017-02-08             NaN        50   open
26            2          4  2013-05-18             NaN        50   open
168           2         14  2013-08-19             NaN        50   open
23            6          2  2013-05-17             NaN        50   open
...         ...        ...         ...             ...       ...    ...
128106    67678        466  2025-01-30             NaN        50   open
122133    67679        466  2025-01-30             NaN        50   open
128109    67679        466  2025-01-30             NaN        50   open
122137    67680        464  2025-01-30             NaN        50   open
128113    67680        464  2025-01-30             NaN        50   open

[128133 rows x 6 columns]

In [29]:
completed_df = df[df['progress'] == 100]  # Filter where progress is 100

print("\nStudents Who Completed Their Courses:")
print(completed_df)

Students Who Completed Their Courses:
        user_id  course_id  enrol_date completion_date  progress     status
21          159         21  2013-10-23      2013-11-19       100  completed
38          231         28  2014-02-06      2014-02-19       100  completed
41          232         28  2014-02-06      2014-04-11       100  completed
87           71         12  2013-08-12      2013-11-11       100  completed
93           73         12  2013-08-12      2013-09-13       100  completed
...         ...        ...         ...             ...       ...        ...
128008    67583        465  2025-01-30      2025-01-30       100  completed
128009    67641        465  2025-01-30      2025-01-30       100  completed
128032    65840        416  2025-01-30      2025-01-30       100  completed
128039    67659        465  2025-01-30      2025-01-30       100  completed
128118    12016        379  2025-01-30      2025-01-30       100  completed

[27453 rows x 6 columns]

In [30]:
progress_summary = df['progress'].value_counts().rename(index={50: "Incomplete", 100: "Completed"})
print("\nCourse Progress Summary:")
print(progress_summary)

Course Progress Summary:
progress
Incomplete    100680
Completed      27453
Name: count, dtype: int64

In [31]:
import pandas as pd

# Ensure progress column is numeric
df['progress'] = pd.to_numeric(df['progress'], errors='coerce')

# Add a status column for better readability
df['status'] = df['progress'].map({100: 'Completed', 50: 'In Progress'})

# Display who enrolled in which course and their status
enrollment_summary = df[['user_id', 'course_id', 'status']]

print("\nEnrollment & Course Completion Status:")
print(enrollment_summary)

Enrollment & Course Completion Status:
        user_id  course_id       status
0            19         14  In Progress
1           155         14  In Progress
2            56         14  In Progress
3           156          3  In Progress
4            35         14  In Progress
...         ...        ...          ...
128128     5099        466  In Progress
128129    12197        466  In Progress
128130     4599        466  In Progress
128131    11020        466  In Progress
128132    21266        466  In Progress

[128133 rows x 3 columns]

In [32]:
completion_count = df.groupby(['user_id', 'status'])['course_id'].count().unstack(fill_value=0)
completion_count.rename(columns={'Completed': 'Courses Completed', 'In Progress': 'Courses In Progress'}, inplace=True)

print("\nCourses Completed vs. In Progress Per Student:")
print(completion_count)

Courses Completed vs. In Progress Per Student:
status   Courses Completed  Courses In Progress
user_id
2                        0                    4
6                       10                  239
7                        0                    6
8                        0                   22
9                        0                   29
...                    ...                  ...
67676                    0                    2
67677                    0                    2
67678                    0                    2
67679                    0                    2
67680                    0                    2

[30848 rows x 2 columns]

In [ ]:
#Consider dropping all entires with 'unknown completion date' and '0000-00-00'

In [ ]:
#df['completion_date'] = pd.to_datetime(df['completion_date'], errors='coerce')  # Convert to datetime

# Filter valid dates (non-null after conversion)
#df_valid_dates = df[df['completion_date'].notna()]

In [ ]:
#df['completion_date'] = pd.to_datetime(df['completion_date'], format='%Y-%m-%d', errors='coerce')

In [ ]:
#df.dropna(subset=["completion_date"], inplace=True)

In [ ]:
#df

In [ ]:
#df_valid_dates = df[~df['completion_date'].isin(['None', '00', '0000-00-00', ''])]  # Exclude invalid values

In [ ]:
#df_cleaned = df[~df["completion_date"].isin(["unknown date", "0000-00-00"])]
#remove rows where the 'completion_date' column contains the values 'unknown date' or '0000-00-00'

#print(df_cleaned)

In [ ]:
#print(df_cleaned["completion_date"].value_counts())

In [ ]:
#df_cleaned

In [ ]:
#print(df_cleaned['progress'].value_counts())

In [ ]:
#print(df_cleaned['status'].value_counts())

In [ ]:
#The number of open values, standing at 100,680 is the same number as the courses which are in progress 
#(they match 100,680 participants with a progress value of '50').

In [ ]:
#df_cleaned["completion_date"]

In [ ]:
#print(df_cleaned["completion_date"].value_counts())

In [ ]:
#df_cleaned = df.dropna(subset=["completion_date"])

In [ ]:
#print(df_cleaned)

In [ ]:
# the rows have reduced from 128,133 to 27,453

In [ ]:
#Now we want to look deeper into the status and progress columns. If 'progress' yields a value of 100, it means the course was completed.

In [ ]:
#print(df_cleaned['progress'].value_counts())

In [ ]:
# the series of code above has removed useful information from the 'status' column. So I will instead replace all row values 
#(with 0000-00-00 and 'unknown date') from the 
#'completed_date' column with NaN